app/Controllers/CiudadanosController.php

SELECT *
FROM `ciudadanos`
---
    public function index()
    {
        $ciudadanosModel = new CiudadanosModel();
        $data['ciudadanos'] = $ciudadanosModel->findAll();