app/Controllers/DepartamentosController.php

SELECT *
FROM `departamentos`
---
    public function index()
    {
        $departamentos = $this->departamentosModel->findAll();