app/Controllers/MunicipiosController.php

SELECT *
FROM `municipios`
---
public function index()
{
    // Lógica para mostrar la lista de municipios
    $municipios = $this->municipiosModel->findAll();