app/Controllers/RegionesController.php

SELECT *
FROM `regiones`
---
    public function index()
    {
        $data['regiones'] = $this->regionModel->findAll();